In [1]:
import numpy as np
import pandas as pd
obj=pd.Series([-4,3,5,1],index=pd.RangeIndex(1,9,2))
#print(obj)
#print(obj.values)
#print(obj.index)
obj2=pd.Series([-4,3,5,1],index=['d','b','c','a'])
print(obj2) 
print(obj2['b'])
print(obj2[obj2>2])
print(obj2*2)
print(np.exp(obj2))

d   -4
b    3
c    5
a    1
dtype: int64
3
b    3
c    5
dtype: int64
d    -8
b     6
c    10
a     2
dtype: int64
d      0.018316
b     20.085537
c    148.413159
a      2.718282
dtype: float64

In [2]:
'b' in obj2

True

In [3]:
'e' in obj2

False

In [4]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
obj3=pd.Series(thisdict)
obj3

brand       Ford
model    Mustang
year        1964
dtype: object

In [5]:
types=['brand','model','name']
obj4=pd.Series(thisdict,types)
obj4

brand       Ford
model    Mustang
name         NaN
dtype: object

In [6]:
pd.isnull(obj4)

brand    False
model    False
name      True
dtype: bool

In [7]:
pd.notnull(obj4)

brand     True
model     True
name     False
dtype: bool

In [8]:
obj3+obj4

brand          FordFord
model    MustangMustang
name                NaN
year                NaN
dtype: object

In [9]:
obj4.name='population'
obj4.index.name='state'
obj4

state
brand       Ford
model    Mustang
name         NaN
Name: population, dtype: object

In [10]:
obj

1   -4
3    3
5    5
7    1
dtype: int64

In [11]:
obj.index=['bob','steve','jeff','ryan']
obj

bob     -4
steve    3
jeff     5
ryan     1
dtype: int64

In [12]:
#DataFrame
data={'state':['ohio','ohio','ohio','Nevada','Nevada','Nevada'],
     'year':[2001,2002,2003,2004,2005,2006],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

   pop   state  year
0  1.5    ohio  2001
1  1.7    ohio  2002
2  3.6    ohio  2003
3  2.4  Nevada  2004
4  2.9  Nevada  2005
5  3.2  Nevada  2006

In [13]:
import numpy as np
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
#frame
#frame.head()
#pd.DataFrame(data,columns=['year','state','pop'])
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
#frame2['state']
#frame2.year
#frame2.loc['three']
#frame2['debt']=2.5
#frame2['debt']=np.arange(6.)
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [14]:
''''x={}
y={}
z={**x,**y}#merging 2 dicts'''

"'x={}\ny={}\nz={**x,**y}#merging 2 dicts"

In [15]:
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [16]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [17]:
'''x = {'Nevada':{2001:1.2,2002:1.5}}
y={'ohio':{2000:1.6,2001:1.7,2002:1.8}}
z={**x,**y}'''
#or
pop={'Nevada':{2001:1.2,2002:1.5},'ohio':{2000:1.6,2001:1.7,2002:1.8}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  ohio
2000     NaN   1.6
2001     1.2   1.7
2002     1.5   1.8

In [18]:
frame3.T

        2000  2001  2002
Nevada   NaN   1.2   1.5
ohio     1.6   1.7   1.8

In [19]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  ohio
2001     1.2   1.7
2002     1.5   1.8
2003     NaN   NaN

In [20]:
s='hello'
s[:-1]

'hell'

In [21]:
pdata={'ohio':frame3['ohio'][:-1],'Nevada':frame3['Nevada'][:3]}
pd.DataFrame(pdata)

      Nevada  ohio
2000     NaN   1.6
2001     1.2   1.7
2002     1.5   NaN

In [22]:
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Nevada  ohio
year
2000      NaN   1.6
2001      1.2   1.7
2002      1.5   1.8

In [23]:
frame3.values

array([[nan, 1.6],
       [1.2, 1.7],
       [1.5, 1.8]])

In [24]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [25]:
#index Objects
obj = pd.Series(range(3),index=['a','b','c'])
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
obj.index[:1]

Index(['a'], dtype='object')

In [27]:
index[1]='d'

NameError: name 'index' is not defined

In [ ]:
labels=pd.Index(np.arange(3))
labels

In [ ]:
obj2=pd.Series([-12,-1.4,0],index=labels)
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.index

In [ ]:
frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
'ohio' in frame3.columns

In [ ]:
dup_labels=pd.Index(['foo','foo','bar','bar'])

dup_labels

In [ ]:
#essential functionality 
#reindexing 
obj=pd.Series([2.5,4,6,5.3],index=['a','b','c','d'])
obj

In [ ]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

In [ ]:
obj3=pd.Series(['red','blue','purple'],index=[0,2,4])
obj3

In [ ]:
obj3.reindex(range(6),method='ffill')

In [ ]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ohio','nevada','enty'])
frame

In [2]:
import numpy as np
import pandas as pd
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['hyd','khi','lah'])
frame2=frame.reindex(['a','b','c','d'])
states=['hyd','multan','lah']
frame2.reindex(columns=states)
frame.loc[['a','b','c','d'],states]

d:\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  import sys

   hyd  multan  lah
a  0.0     NaN  2.0
b  3.0     NaN  5.0
c  6.0     NaN  8.0
d  NaN     NaN  NaN

In [29]:
x=np.array(['bob','will','will','bob','will','joe'])
np.unique(x)

array(['bob', 'joe', 'will'], dtype='<U4')

In [5]:
#dropping entries from an axis
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [6]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [7]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [9]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['hyd','karachi','lah','quetta'],
                 columns=['one','two','three','four'])
data

         one  two  three  four
hyd        0    1      2     3
karachi    4    5      6     7
lah        8    9     10    11
quetta    12   13     14    15

In [10]:
import pandas as pd
import numpy as np
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['hy','lah','khi','isl'],
                 columns=['one','two','three','four'])
#data.drop(['hy','lah'])
#data.drop(['one','two'],axis=1)
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
#obj.drop('c',inplace=True)
#indexing,Selection, and Filtering
obj['b']
obj[1]
obj[2:4]
obj[[1,3]]
obj[obj<2]
obj['b':'c']
obj['b':'c']=5
data[:2]
print(data,'\n')
data[data['three'] > 5]
data<5
data[data<5]
data[data<5]=0
data

     one  two  three  four
hy     0    1      2     3
lah    4    5      6     7
khi    8    9     10    11
isl   12   13     14    15

     one  two  three  four
hy     0    0      0     0
lah    0    5      6     7
khi    8    9     10    11
isl   12   13     14    15

In [11]:
data

     one  two  three  four
hy     0    0      0     0
lah    0    5      6     7
khi    8    9     10    11
isl   12   13     14    15

In [12]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['hyd','karachi','lah','quetta'],
                 columns=['one','two','three','four'])
data

         one  two  three  four
hyd        0    1      2     3
karachi    4    5      6     7
lah        8    9     10    11
quetta    12   13     14    15

In [13]:
data.loc['karachi',['one','two']]

one    4
two    5
Name: karachi, dtype: int32

In [14]:
#similar selecction with integers
data.iloc[1,[0,1]]

one    4
two    5
Name: karachi, dtype: int32

In [15]:
 data.iloc[1]

one      4
two      5
three    6
four     7
Name: karachi, dtype: int32

In [16]:
data.iloc[[0,1],[3,0,1]]

         four  one  two
hyd         3    0    1
karachi     7    4    5

In [17]:
data.loc[:'lah','two']

hyd        1
karachi    5
lah        9
Name: two, dtype: int32

In [18]:
data.iloc[:,:3][data.three>5]

         one  two  three
karachi    4    5      6
lah        8    9     10
quetta    12   13     14

In [20]:
#integer indexes
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [22]:
ser2=pd.Series(np.arange(3.),index=['a','b','c'])
ser2[-1]

2.0

In [23]:
ser[:1]

0    0.0
dtype: float64

In [24]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [25]:
ser.iloc[:1]

0    0.0
dtype: float64

In [26]:
s1=pd.Series(np.arange(4),index=['a','b','d','f'])
s2=pd.Series(np.arange(5,9),index=['a','b','g','h'])
s1+s2

a    5.0
b    7.0
d    NaN
f    NaN
g    NaN
h    NaN
dtype: float64

In [30]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                             index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [31]:
df1 = pd.DataFrame({'A':[4, 5]})
df2 = pd.DataFrame({'B': [3, 4]})
df1+df2

    A   B
0 NaN NaN
1 NaN NaN